<?php

namespace Faker\Provider\hi_IN;

class Address extends \Faker\Provider\Address
{
    protected static $buildingNumber = array('%###', '%##', '%#', '%###/#', '%##/#', '%#/#', '%###/##', '%##/##', '%#/##');
    protected static $societySuffix = array(
        'सोसाइटी','अपार्टमेंट','हाइट्स','विलास',
    );
    protected static $streetSuffix = array(
        'मार्ग','सड़क','गली','पथ','रोड',
    );
    protected static $localityName = array(
        'औंध','अँधेरी',
        'बोरीवली','बांद्रा',
        'चिंचवड़','चांदपोल','चर्चगेट','साइबर सिटी',
        'दादर','डेक्कन जिमखाना',
        'गोरेगॉव',
        'हडपसर','हरमाड़ा','हिंजेवाड़ी',
        'कोरमंगला','खराड़ी',
        'मराथल्ली','मॉडल टाउन','मानसरोवर','मालदा',
        'सोडाला',
        'विरार','विखरोली',
        'येरवडा','यशवंतपुर',
    );
    protected static $cityPrefix = array(
        'नया','नयी','नई','नवी','पुराना', 'पुरानी','पूर्व','पूर्वी','पश्चिम','पश्चमी','उत्तर','उत्तरी','दक्षिण','दक्षिणी',
    );
    protected static $citySuffix = array(
        ' नगर','पुर','ग्रह','गंज',' चौक',
    );
    protected static $indianCity = array(
        'अहमदाबाद','अजमेर','अलवर',
        'आगरा',
        'इंदौर',
        'उदयपुर',
        'कोलकाता','कानपुर','कोटा','कोची',
        'गांधीनगर','गुवाहाटी','गैंगटॉक','गुरुग्राम',
        'चेन्नई','चंडीग़र',
        'जयपुर','जोधपुर','जम्मू','जामनगर','जबलपुर',
        'दार्जलिंग','देहरादून','दिल्ली',
        'तिरुवंतपुरम','त्रिची',
        'नागपुर','नासिक','नॉएडा','नई दिल्ली',
        'पुने','पटना','पणजी','पिलानी','पांडिचेरी',
        'फरीदाबाद',
        'बैंगलूर','बीकानेर',
        'भुवनेष्वर','भोपाल',
        'मुंबई','मेरठ','मैसूर',
        'रतलाम','रायपुर','रांची','राजकोट',
        'लुधियाना','लखनऊ',
        'विशाखापट्नम','वड़ोदरा','वारंगल',
        'शिमला','श्रीनगर',
        'सूरत',
        'हैदराबाद','हिसार',
    );
    protected static $state = array(
        // States
        'अरूणांचल प्रदेश', 'असम',
        'आन्ध्रा प्रदेश',
        'ओडिसा',
        'उत्तर प्रदेश', 'उत्तराखंड',
        'कर्नाटक', 'केरल',
        'गोवा', 'गुजरात',
        'छत्तीसगढ़',
        'जम्मू और कश्मीर',
        'झारखण्ड',
        'बिहार',
        'तमिलनाडु', 'तेलंगाना', 'त्रिपुरा',
        'नागालैंड',
        'पंजाब', 'पश्चिम बंगाल',
        'मध्य प्रदेश', 'महाराष्ट्र', 'मणिपुर', 'मेघालय', 'मिजोरम',
        'राजस्थान',
        'सिक्किम',
        'हरियाणा', 'हिमांचल प्रदेश',
        // Union Territories
        'अण्डमान और निकोबार द्वीप समूह',
        'चण्डीग़र',
        'दादर  और नगर हवेली', 'दमन और दीव', 'दिल्ली',
        'लक्षद्वीप',
        'पुडुचेरी',
    );
    protected static $stateAbbr = array(
       'AP', 'AR', 'AS', 'BR', 'CG', 'GA', 'GJ', 'HR', 'HP', 'JK', 'JH', 'KA', 'KL', 'MP', 'MH', 'MN', 'ML', 'MZ', 'NL', 'OD', 'PB', 'RJ', 'SK', 'TN', 'TS', 'TR', 'UP', 'UK', 'WB', 'AN', 'CH', 'DN', 'DD', 'DL', 'LD', 'PY'
    );
    protected static $country = array(
        'अफ़ग़ानिस्तान','अमेरिकन समोआ','अरूबा','अर्जेंटीना','अल्बानिया',
        'आइसलैंड','आज़रबाइजान','आयरलैंड','आर्मीनिया','ऑस्ट्रिया','ऑस्ट्रेलिया',
        'इक्वेडोर','इजराइल','इटली','इंडोनेशिया','इथियोपिया','इराक','इरिट्रिया',
        'ईरान',
        'उज़्बेकिस्तान','उत्तरी मरीयाना द्वीप समूह','उरुग्वे',
        'एंगुइला','एल साल्वाडोर','एलजीरिया','एस्तोनिया',
        'ओमान',
        'अंगोला','अंटार्कटिका (क्षेत्र 60 डिग्री एस के दक्षिण)','अंडोरा','अंतिगुया और बार्बूडा',
        'कजाखस्तान','कतर','कनाडा','कंबोडिया','काग़ज़ का टुकड़ा','कांगो','कांगो','किरिबाती','किर्गिज गणराज्य','कुक द्वीपसमूह','कुवैट','केंद्रीय अफ्रीकन गणराज्य','केन्या','केप वर्दे','केमैन टापू','कैमरून','कोकोस (कीलिंग) द्वीप','कोट डी आइवर','कोमोरोस','कोरिया','कोरिया','कोलम्बिया','कोस्टा रिका','क्यूबा','क्रिसमस द्वीप','क्रोएशिया',
        'गाम्बिया','गिनी-बिसाऊ','गिन्नी','गुआम','गुयाना','गैबॉन','ग्रीनलैंड','ग्रेनेडा','ग्वाटेमाला','ग्वाडेलोप','ग्वेर्नसे',
        'घाना',
        'चिली','चीन','चेक गणतंत्र',
        'जमैका','जर्मनी','जर्सी','जाना','जापान','जाम्बिया','जिबूती','जिब्राल्टर','जिम्बाब्वे','जॉर्जिया','जॉर्डन',
        'टोकेलाऊ','टोंगा','ट्यूनीशिया',
        'डेनमार्क','डोमिनिकन गणराज्य','डोमिनिका',
        'तजाकिस्तान','तंजानिया','ताइवान','तिमोर-लेस्ते','तुर्कमेनिस्तान','तुर्की','तुर्क्स और कैकोज़ द्वीपसमूह','तुवालु',
        'थाईलैंड',
        'दक्षिण अफ्रीका','दक्षिण जोर्जिया और दक्षिण सैंडविच द्वीपसमूह','दक्षिणी फ्राँसिसी क्षेत्र',
        'नाइजर','नाइजीरिया','नाउरू','नामीबिया','निकारागुआ','नियू','नीदरलैंड','नीदरलैंड्स एंटाइल्स','नेपाल','नॉरफ़ॉक आइलैंड','नॉर्वे','न्यू कैलेडोनिया','न्यूजीलैंड',
        'पनामा','परागुआ','पलाऊ','पश्चिमी सहारा','पाकिस्तान','पापुआ न्यू गिनी','पिटकैर्न आइलैंड्स','पुनर्मिलन','पुर्तगाल','पेरू','पोलैंड','प्यूर्टो रिको',
        'फ़िजी','फिनलैंड','फिलीपींस','फिलीस्तीनी इलाके','फ़ैरो द्वीप','फ़ॉकलैंड द्वीप (माल्विनास)','फ्रांस','फ्रेंच गयाना','फ्रेंच पॉलीनेशिया',
        'बरमूडा','बहरीन','बहामा','बांग्लादेश','बारबाडोस','बुर्किना फासो','बुल्गारिया','बुवेत आइलैंड (बूवेटोया)','बुस्र्न्दी','बेनिन','बेलीज','बेलोरूस','बेल्जियम','बोत्सवाना','बोलीविया','बोस्निया और हर्जेगोविना','ब्राज़िल','ब्रिटिश वर्जिन आईलैन्ड्स','ब्रिटिश हिंद महासागरीय क्षेत्र (छागोस द्वीपसमूह)','ब्रुनेई दारुस्सलाम',
        'भारत','भूटान','भूमध्यवर्ती गिनी',
        'मकाओ','मंगोलिया','मलावी','मलेशिया','माइक्रोनेशिया','मार्टीनिक','मार्शल द्वीप समूह','मालदीव','माली','माल्टा','मिस्र','मेक्सिको','मेडागास्कर','मैन द्वीप','मैयट','मैसेडोनिया','मॉरिटानिया','मॉरीशस','मोजाम्बिक','मोंटेनेग्रो','मोंटेसेराट','मोनाको','मोरक्को','मोलदोवा','म्यांमार',
        'यमन','युगांडा','यूक्रेन','यूनाइटेड किंगडम','यूनान',
        'रवांडा','रूसी संघ','रोमानिया',
        'लक्समबर्ग','लाइबेरिया','लाओ पीपुल्स की लोकतांत्रिक गणराज्य','लातविया','लिकटेंस्टीन','लिथुआनिया','लिसोटो','लीबिया का अरब जमहिरिया','लेबनान',
        'वानुअतु','वाली और फ़्युटुना','वियतनाम','वेनेजुएला',
        'श्री लंका',
        'सऊदी अरब','संत किट्ट्स और नेविस','संत मार्टिन','संत विंसेंट अँड थे ग्रेनडीनेस','समोआ','संयुक्त अरब अमीरात','संयुक्त राज्य अमरीका','संयुक्त राज्य अमेरिका के छोटे दूरस्थ द्वीपसमूह','संयुक्त राज्य अमेरिका वर्जिन द्वीप समूह','सर्बिया','साइप्रस','साओ टोमे और प्रिंसिपे','सिंगापुर','सियरा लिओन','सीरियाई अरब गणराज्य','सूडान','सूरीनाम','सेंट पियरे और मिकेलॉन','सेंट बार्थेलेमी','सेंट लूसिया','सेंट हेलेना','सेनेगल','सेशेल्स','सैन मैरीनो','सोमालिया','सोलोमन इस्लैंडस','स्पेन','स्लोवाकिया (स्लोवाक गणराज्य)','स्लोवेनिया','स्वाजीलैंड','स्वालबार्ड और जैन मायेन द्वीपसमूह','स्विट्जरलैंड','स्वीडन',
        'हंगरी','हर्ड आइलैंड और मैकडोनाल्ड आइलैंड्स','हैती','हॉगकॉग','होंडुरस','होली सी (वैटिकन सिटी राज्य)',
        'त्रिनिदाद और टोबैगो',
    );
    protected static $postcode = array(
        '1#####','2#####','3#####','4#####','5#####','6#####','7#####','8#####',
    );

    protected static $societyNameFormat = array(
        '{{firstName}} {{societySuffix}}'
    );
    protected static $streetNameFormats = array(
        '{{firstName}} {{streetSuffix}}',
        '{{lastName}} {{streetSuffix}}'
    );
    protected static $localityFormats = array(
        '{{firstName}}{{citySuffix}}',
        '{{cityPrefix}} {{localityName}}',
        '{{localityName}}'
    );
    protected static $streetAddressFormats = array(
        '{{buildingNumber}}, {{locality}},',
        '{{buildingNumber}}, {{streetName}}',
        '{{buildingNumber}}, {{societyName}}, {{locality}}',
        '{{buildingNumber}}, {{streetName}} {{societyName}}',
        '{{buildingNumber}}, {{streetName}} {{societyName}}, {{locality}}',
    );
    protected static $cityFormats = array(
        '{{indianCity}}',
        '{{cityPrefix}} {{indianCity}}',
        '{{cityPrefix}} {{firstName}}{{citySuffix}}',
        '{{cityPrefix}} {{firstName}}',
        '{{firstName}}{{citySuffix}}',
        '{{lastName}}{{citySuffix}}',
    );
    protected static $addressFormats = array(
        '{{streetAddress}}, {{city}} - {{postcode}}',
        '{{streetAddress}}, {{postcode}} {{city}}',
        '{{streetAddress}}, {{city}}, {{state}} - {{postcode}}',
        '{{streetAddress}}, {{city}}, {{postcode}} {{state}}',
    );

    public function societySuffix()
    {
        return static::randomElement(static::$societySuffix);
    }
    public function localityName()
    {
        return static::randomElement(static::$localityName);
    }
    public static function cityPrefix()
    {
        return static::randomElement(static::$cityPrefix);
    }
    public function indianCity()
    {
        return static::randomElement(static::$indianCity);
    }
    public static function state()
    {
        return static::randomElement(static::$state);
    }
    public static function stateAbbr()
    {
        return static::randomElement(static::$stateAbbr);
    }

    public function societyName()
    {
        return $this->generator->parse(static::randomElement(static::$societyNameFormat));
    }
    public function locality()
    {
        return $this->generator->parse(static::randomElement(static::$localityFormats));
    }
}
