<?php

namespace Faker\Provider\hi_IN;

class Company extends \Faker\Provider\Company
{
    protected static $formats = array(
        '{{lastName}} {{companySuffix}}',
        '{{lastName}}-{{lastName}}',
        '{{lastName}}, {{lastName}} और {{lastName}}',
    );

    protected static $catchPhraseWords = array(
        array(
            'अग्र-पंक्ति','अग्रकय','अनन्य','अनिवार्य','अनुकूलन','अनुकूलित','अनुकूली','अभिनव',
            'आत्मसात','आमने सामने',
            'उद्यम-व्यापी','उन्नत','उपयोगकर्ता केंद्रित','ऊपर आकार',
            'ऐच्छिक',
            'ऑपरेटिव',
            'कम किया हुआ','का आयोजन किया','कार्बनिक','कार्यान्वित','काल्पनिक','केन्द्रीकृत','को एकीकृत','क्रॉस-प्लेटफॉर्म','क्रॉस-समूह','क्लोन','क्षैतिज',
            'खुला स्त्रोत',
            'गहन','गुणवत्ता केंद्रित','ग्राहक केंद्रित',
            'चरणबद्ध',
            'ज़बरदस्त','जमीनी',
            'टीम उन्मुख','ट्रिपल-बफ़र',
            'डिजीटल','डी-इंजीनियर',
            'दृढ़',
            'ध्यान केंद्रित','ध्रुवीकृत',
            'नजर रखी','निर्देशयोग्य','निर्बाध','नीचे आकार','नेटवर्क','न्यागत',
            'पुनः संगठित','पुन: इंजीनियर','पूरी तरह से विन्यास','प्रगतिशील','प्रबंधित',
            'बढ़ी','बहु-स्तरीय','बहुपक्षीय','बहुमुखी','बहुस्तरीय','बुद्धिसंगत',
            'भविष्य-रहित',
            'मजबूत','मल्टी पहुंचाया','मौलिक',
            'यूजर फ्रेंडली','यूनिवर्सल',
            'रिएक्टिव','रिवर्स-इंजीनियर',
            'लाभ केंद्रित',
            'वस्तु आधारित','वास्तविक','विकेन्द्रीकृत','विजन उन्मुख','वितरित','विन्यास','विविध','विस्तारित','विस्तृत','व्यापार केंद्रित',
            'श्लोक में',
            'सक्रिय','संगत','संतुलित','संपूर्ण','समारोह आधारित','सहज ज्ञान युक्त','सही आकार','साझा किए जाने योग्य','सार्वजनिक कुंजी','सिंक्रनाइज़','सुरक्षित','स्टैंड-अलोन','स्व सक्षम करने','स्वचालित',
        ),
        array(
            '24 घंटे','24/7','3 पीढ़ी','4 पीढ़ी','5 वीं पीढ़ी','6 पीढ़ी',
            'अगली पीढ़ी','अग्रणी धार','अग्रभूमि','अच्छी संग्राहक','अतुल्यकालिक','अधिकतम','अनुकूलन','अनुमानी','अमूर्त','अलग',
            'इंटरैक्टिव','इष्टतम',
            'उग्र','उत्तरदायी','उपयोगकर्ता-उन्मुख',
            'ऊँचा स्तर','ऊपर की ओर रुझान वाले',
            'कार्यकारी अधिकारी','क्लाइंट सर्वर','क्षेत्रीय',
            'गतिशील','ग्राहक चालित','ग्रिड सक्षम',
            'जमीनी स्तर','जरूरत अनुसार','जरूरतों के आधार पर','जोड़नेवाला',
            'तटस्थ','ताजा सोच','तृतीयक',
            'दिशात्मक',
            'द्वि-दिशात्मक','द्विभाजित',
            'नॉन-वोलाटाइल','पर्यावरण केंद्रित','पारस्परिक','पूरी श्रृंखला','पृष्ठभूमि','प्रणाली योग्य','प्रणालीगत','प्रभावपूर्ण','प्रेरित',
            'बहु कार्यण','बहु राज्य','बिना किसी खराबी के','बैंडविड्थ की निगरानी में',
            'मध्यम','मल्टीमीडिया','महत्वपूर्ण मिशन','माध्यमिक','मानव संसाधन','मुखर','मॉड्यूलर','मोबाइल',
            'रवैया उन्मुख','राष्ट्रीय','रियल टाइम','रिसते हुए',
            'वर्दी','वर्धित मूल्य','वस्तु के उन्मुख','वास्तविक','विश्लेषण','वृद्धिशील','वेब-सक्षम','वैश्विक','व्यवस्थित',
            'शामिल','शिक्षाप्रद','शुन्य सहनशक्ति',
            'संकर','संक्रमणकालीन','सजातीय','संदर्भ के प्रति संवेदनशील','संदर्भ-आधारित','समग्र','समर्पित','समाधान उन्मुख','सशक्त बनाने','सहिष्णु गलती','साजो','सामग्री आधारित','सुसंगत','स्केलेबल','स्थानीय','स्थिर','स्पष्ट सोच',
        ),
        array(
            'अधिरचना','अनुकरण','अनुकूलक','अनुक्रम',
            'आकस्मिकता','आदर्श','आधारिक संरचना','आर्किटेक्चर','आवेदन',
            'इंटरफेस','इंट्रानेट',
            'उत्तोलन','उत्पाद','उत्पादकता','उपयोग','उपाय',
            'एक्स्ट्रानेट','एन्कोडिंग','एन्क्रिप्शन',
            'कर्मचारियों की संख्या','कलन विधि','कार्य दल','कार्यक्षमताओं','कार्यप्रणाली','कार्यान्वयन','कृत्रिम होशियारी','कोर','क्षमता',
            'खुली प्रणाली',
            'ग्राफिकल यूज़र इंटरफ़ेस','ग्राहकों के प्रति वफादारी','ग्रुपवेयर',
            'चुनौती',
            'जटिलता','ज्ञानधार',
            'टूलसेट',
            'डेटा वेयरहाउस','डेटाबेस',
            'ढांचा',
            'तंत्रिका शुद्ध','तालमेल',
            'द्वार',
            'निगरानी','निर्देश समुच्चय','नीति',
            'परिभाषा','परियोजना','पहल','पहुंच','पुरालेख','पूर्वानुमान','प्रक्रिया में सुधर','प्रक्षेपण','प्रवास',
            'फर्मवेयर','फोकस समूह',
            'बेंचमार्क',
            'मध्यस्थ','मसविदा बनाना','मानकीकरण','मिडलवेयर','मिसाल','मूल्य निर्धारण का ढांचा','मैट्रिक्स',
            'योग्यता',
            'रणनीति','रवैया','रोक',
            'लचीलापन',
            'वाद्य-स्थान','विश्लेषक','वेबसाइट',
            'संकल्पना','संधि','सफलता','समय सीमा','समर्थन','समानता','समारोह','समूह','संरचना','सरणी','सर्किट','सहयोग','सहायता केंद्र','सेवा डेस्क','सॉफ्टवेयर','स्थानीय क्षेत्र अंतरजाल','स्थापना',
            'हब','हार्डवेयर',
        ),
    );

    protected static $bsWords = array(
        array(
            'अधिकतम','अनुकूलन',
            'आर्केस्ट्रा करना','आलिंगन',
            'इंजीनियर','ई-सक्षम',
            'उत्तोलन','उत्पन्न','उद्धार','उपयोग',
            'एक नए अंदाज़ में','एकीकृत',
            'कल्पना','की सुविधा','कुछ नया','कुल','को जब्त','क्रांतिकारी बदलाव',
            'चलाना',
            'जाल',
            'तालमेल कायम','तैनात',
            'दिलाने',
            'धातु के सिक्के बनाना',
            'परिवर्तन','पुनरावृति','प्रोत्साहित',
            'फिर से परिभाषित',
            'बढ़ने','बढ़ाने','बेंचमार्क','ब्रांड',
            'मैट्रिक्स',
            'रणनीति',
            'लक्ष्य','लागू',
            'वास्तुकार','विकसित करना','विस्तार','व्हाइटबोर्ड',
            'शीघ्र','शोषण, अनुचित लाभ उठाना',
            'संक्रमण','सक्षम','संलग्न','सशक्त','संश्लेषण','साज़','सिंडीकेट','सुवीही','सेते','स्केल',
        ),
        array(
            '24/365','24/7',
            'अगली पीढ़ी','अग्रणी','अग्रणी धार','अनुकूलित','अभिनव','अलग सोच',
            'इंटरैक्टिव','ई-व्यापार','ईंटों और क्लिक्स',
            'उत्तम नस्ल','उद्यम','उपयोगकर्ता केंद्रित',
            'एक से एक','एक्स्टेंसिबल',
            'कामुक','काल्पनिक','कुशल','को एकीकृत','क्रांतिकारी','क्लिक्स के अड्डों',
            'खड़ा','खुला स्त्रोत','खून बहता किनारा',
            'गतिशील',
            'घर्षणहीन',
            'चिपचिपा','चुंबकीय',
            'डॉट कॉम',
            'तार रहित','तिरछा माध्यम',
            'दानेदार','देशव्यापी',
            'धनी',
            'निर्बाध',
            'पार मंच','पारदर्शक','प्रभावपूर्ण',
            'फ़्रंट एंड',
            'बारी कुंजी','बी 2 बी','बी 2 सी','बैक-एंड',
            'मजबूत','महत्वपूर्ण मिशन',
            'रियल टाइम',
            'लगाओ और चलाओ',
            'वर्धित मूल्य','वायरल','वास्तविक','वितरित','विश्वस्तरीय','वेब-सक्षम','वैश्विक',
            'शुरू से अंत तक',
            'सक्रिय','समग्र','सम्मोहक','सहज ज्ञान युक्त','सहयोगी','सामरिक','स्केलेबल',
            'हत्यारा',
        ),
        array(
            'अनुप्रयोगों','अनुभवों','अभिसरण',
            'आंखों','आधारभूत संरचनाओं','आर्किटेक्चर','आलों',
            'इंटरफेस','ई-कॉमर्स','ई-बाजारों','ई-व्यापार','ई-सेवाओं',
            'उदाहरण','उपयोगकर्ताओं',
            'कार्यक्षमताओं','कार्रवाई आइटम','के तरीके',
            'चैनलों',
            'डिलिवरेबल्स',
            'नेटवर्क',
            'पहल','पहुंचाने का तरीका','पोर्टल','प्रौद्योगिकियों','प्लेटफार्मों',
            'बाजार',
            'बैंडविड्थ',
            'भागीदारी',
            'माइंडशेयर','मैट्रिक्स','मॉडल के',
            'रिश्तों',
            'लागत पर लाभ',
            'वेब तत्परता','वेब सेवाएं',
            'समाधान की','समुदायों','सहयोग','सामग्री','सिस्टम','स्कीमा',
        ),
    );

    /**
     * Source - http://www.careerplanner.com/ListOfJobs.cfm
     */
    protected static $jobTitleFormat = array(
        'अचल संपत्ति मूल्यांकक','अदालत कि पत्रकार','अध्यापक','अनुपालन अधिकारी','अनुवादक','अनुशीर्षक लेखक','अपराध अनुसंधानकर्ता','अपशिष्ट उपचार संयंत्र ऑपरेटर','अभिनेता','अभियांत्रिकी','अभियांत्रिकी प्रबंधक','अम्बुलेंस चालक','अर्थशास्त्र शिक्षक','अर्थशास्त्री','अर्धन्यायिक','असबाब बनानेवाला',
        'आउटडोर पावर उपकरण मैकेनिक','आंकलन करनेवाला','आग अन्वेषक','आग निरीक्षक','आग सेनानी','आग-निवारण इंजीनियर','आंतरिक साजसज्जा विशेषज्ञ','आदेश क्लर्क','आदेश भराव','आपातकालीन चिकित्सा तकनीशियन और सहायक चिकित्सक','आपातकालीन प्रबंधन विशेषज्ञ','आभूषण मॉडल','आर.एन.','आर्टिलरी अधिकारी','आर्टिलरी क्रू सदस्य','आवास प्रबंधक','आवासीय सलाहकार','आव्रजन इंस्पेक्टर','आहार जनित तकनीशियन',
        'इंजन असेंबलर','इंजीनियर','इंजीनियरिंग टेक्निशियन','इंजीनियरिंग शिक्षक','इंटरनिस्ट','इंटरेक्शन डिजाइनर','इतिहास के अध्यापक','इतिहासकार','इन्सुलेशन इंस्टालर','इन्सुलेशन कार्यकर्ता','इलस्ट्रेटर','इलेक्ट्रिक मीटर इंस्टालर','इलेक्ट्रिक मोटर मरम्मतकर्ता','इलेक्ट्रिकल इंजीनियरिंग तकनीशियन','इलेक्ट्रिकल और इलेक्ट्रॉनिक इंस्पेक्टर और परीक्षक','इलेक्ट्रिकल और इलेक्ट्रॉनिक्स प्रारूपक','इलेक्ट्रिकल पार्ट्स रिकंडीशनर','इलेक्ट्रॉनिक इंजीनियरिंग तकनीशियन','इलेक्ट्रॉनिक उपकरण असेंबलर','इलेक्ट्रॉनिक प्रारूपक','इलेक्ट्रॉनिक मास्किंग सिस्टम ऑपरेटर','इलेक्ट्रॉनिक्स अभियंता','इलेक्ट्रॉनिक्स इंजीनियरिंग तकनीशियन','इलेक्ट्रो-मैकेनिकल तकनीशियन','इवेंट प्लानर','इंस्ट्रुमेंटेशन तकनीशियन','इस्पात कार्यकर्ता','इंस्पेक्टर',
        'उत्तोलक और चरखी ऑपरेटर','उत्पाद प्रबंधन नेता','उत्पाद प्रमोटर','उत्पाद विशेषज्ञ','उत्पाद सुरक्षा इंजीनियर','उत्पादक','उत्पादन इंस्पेक्टर','उत्पादन कार्यकर्ता','उत्पादन नियंत्रण प्रबंधक','उत्पादन प्रबंधक','उत्पादन मजदूर','उत्पादन योजना','उत्पादन योजनाकार','उत्पादन हेल्पर','उद्घोषक','उपकरण और मरो निर्माता','उपकरण चोखा','उपकरण मरम्मतकर्ता','उपकरण सेट-अप ऑपरेटर','उपयोगिता मीटर रीडर','उपशिक्षक','उल्लखित परिचारिका',
        'ऋण अधिकारी','ऋण काउंसेलर','ऋण साक्षात्कारकर्ता',
        'एकाधिक मशीन उपकरण सेटर','एचआर विशेषज्ञ','एचवीएसी मैकेनिक','एथलीट और खेल प्रतियोगी','एनीलिंग मशीन ऑपरेटर','एम्बॉसिंग मशीन ऑपरेटर','एयर क्रू अधिकारी','एयर क्रू के प्रबंधक','एयर क्रू सदस्य','एयरफील्ड संचालन विशेषज्ञ','एयरफ्रेम मैकेनिक','एयरलाइन पायलट','एयरोस्पेस इंजीनियर','एल्गोरिथ्म डेवलपर',
        'ऑडियो और वीडियो उपकरण तकनीशियन','ऑडियोलॉजिस्ट','ऑनलाइन विपणन विश्लेषक','ऑपरेटिंग इंजीनियर','ऑप्टिकल साधन असेंबलर','ऑप्टिशियंस','ऑप्टोमेट्रिस्ट','ऑफसेट पत्थर के छापे से प्रेस ऑपरेटर',
        'ओथडोटिस',
        'औद्योगिक इंजीनियर','औद्योगिक इंजीनियरिंग तकनीशियन','औद्योगिक उत्पादन प्रबंधक','औद्योगिक उपकरण रखरखाव','औद्योगिक मशीनरी मैकेनिक','औद्योगिक सुरक्षा इंजीनियर','औद्योगिक-संगठनात्मक मनोवैज्ञानिक','औषधि बिक्री प्रतिनिधि',
        'अंकन क्लर्क','अंकन मशीन ऑपरेटर','अंग्रेजी भाषा अध्यापक','अंतरिक्ष विज्ञान शिक्षक','अंतिम संस्कार निदेशक','अंतिम संस्कार परिचर','अंपायर और रेफरी','अंशांकन तकनीशियन',
        'कतरनी मशीन सेट-अप ऑपरेटर','कन्वेयर ऑपरेटर','कपड़े धोने का कार्यकर्ता','कप्तान','कंप्यूटर','कंप्यूटर ऑपरेटर','कंप्यूटर नियंत्रित मशीन उपकरण ऑपरेटर','कंप्यूटर प्रोग्रामर','कंप्यूटर विज्ञान शिक्षक','कंप्यूटर वैज्ञानिक','कंप्यूटर सहायता विशेषज्ञ','कंप्यूटर सिस्टम व्यवस्थापक','कंप्यूटर सिस्टम्स विश्लेषक','कंप्यूटर सुरक्षा विशेषज्ञ','कंप्यूटर सॉफ़्टवेयर इंजीनियर','कंप्यूटर हार्डवेयर इंजीनियर','कमान नियंत्रण केंद्र अधिकारी','कमान नियंत्रण केंद्र विशेषज्ञ','कमानी पेवर','कम्पयूटर विशेषज्ञ','कम्प्यूटर मरम्मतकर्ता','कला निर्देशक','कला शिक्षक','कलाकार','कल्याण पात्रता क्लर्क','कवि','कसाई','कंसीयज','कस्टम दर्जी','कागज का सामान मशीन ऑपरेटर','कांच का काम करनेवाला','कांच ब्लोअर','काटना मशीन उपकरण सेटर','काटना मशीन ऑपरेटर','काटना मशीन सेटर','काटोग्रफ़र','कानून क्लर्क','कानून प्रवर्तन शिक्षक','कानून शिक्षक','कानूनी सचिव','कानूनी सहायता कार्यकर्ता','कारिदा','कार्टूनिस्ट','कार्मिक भर्तीकर्ता','कार्यकारी प्रबंधक','कार्यकारी सचिव','कार्यक्रम का संचालक','कार्यालय और प्रशासनिक सहायता कार्यकर्ता','कार्यालय मशीन ऑपरेटर','कार्यालय लिपिक','कालीन लगाने','कास्टिंग मशीन ऑपरेटर','कास्टिंग मशीन सेट-अप ऑपरेटर','किसान','किसी न किसी तरह बढ़ई','कीट नियंत्रण कार्यकर्ता','कीटनाशक स्प्रेयर','कीबोर्ड साधन मरम्मतकर्ता और ट्यूनर','कीमती पत्थर कार्यकर्ता','कुम्हार','कृषि इंजीनियर','कृषि उत्पाद ग्रेडर सॉर्टर','कृषि उपकरण ऑपरेटर','कृषि कार्यकर्ता','कृषि तकनीशियन','कृषि निरीक्षक','कृषि प्रबंधक','कृषि फसल कार्यकर्ता','कृषि फसल खेत प्रबंधक','कृषि बिक्री प्रतिनिधि','कृषि विज्ञान तकनीशियन','कृषि विज्ञान शिक्षक','केंद्रीय कार्यालय','केंद्रीय कार्यालय ऑपरेटर','केंद्रीय कार्यालय और पीबीएक्स इंस्टॉलर','केशियर','कैफेटेरिया कुक','कैमरा ऑपरेटर','कैमरा मरम्मतकर्ता','कैरियर सलाहकार','कॉपी मशीन ऑपरेटर','कॉपी राइटर','कॉर्पोरेट ट्रेनर','कॉस्टयूम परिचर','कोच और स्काउट','कोटिंग मशीन ऑपरेटर','कोडांतरक','कोरियोग्राफर','कोरोनर','क्यूरेटर','क्रय प्रबंधक','क्रशिंग पीस मशीन ऑपरेटर','क्राफ्ट कलाकार','क्रासिंग गार्ड','क्रिएटिव राइटर','क्रेडिट चेकर्स क्लर्क','क्रेडिट परीक्षक','क्रेडिट विश्लेषक','क्रेता','क्रेन और टॉवर ऑपरेटर','क्लर्क','क्लीनिकल स्कूल मनोवैज्ञानिक',
        'खगोलविद','खंडपीठ जौहरी','खतरनाक पदार्थों को हटाने कार्यकर्ता','खनन अभियन्ता','खनन मशीन ऑपरेटर','खराद संचालक','खरीद क्लर्क','खरीददारी एजेंट','खाता प्रबंधक','खाद्य तम्बाकू बरस रही','खाद्य पाक कला मशीन ऑपरेटर्स','खाद्य विज्ञान तकनीशियन','खाद्य वैज्ञानिकों और टेक्नोलॉजिस्ट','खाद्य सर्वर','खाद्य सेवा प्रबंधक','खाने की तैयारी','खुदरा विक्रेता','खुदाई मशीन ऑपरेटर','खेत और घर प्रबंधन सलाहकार','खेत श्रम ठेकेदार','खेतिहर मज़दूर','खैर और कोर ड्रिल ऑपरेटर','खोदनेवाला',
        'गणितज्ञ','गणितीय तकनीशियन','गणितीय विज्ञान शिक्षक','गणितीय वैज्ञानिक','गश्ती अधिकारी','गायक','गीतकार','गृह व्यवस्था पर्यवेक्षक','गेमिंग केज कार्यकर्ता','गेमिंग डीलर','गेमिंग निगरानी अधिकारी','गेमिंग पर्यवेक्षक','गेमिंग प्रबंधक','गेमिंग सेवा कार्यकर्ता','गैस उपकरण मरम्मतकर्ता','गैस कंप्रेसर ऑपरेटर','गैस पम्पिंग स्टेशन ऑपरेटर','गैस प्रसंस्करण संयंत्र ऑपरेटर','गैस प्लांट ऑपरेटर','गैस वितरण संयंत्र ऑपरेटर','गोदाम','ग्राफिक डिजाइनर','ग्राहक सेवा के पर्यवेक्षक','ग्राहक सेवा प्रतिनिधि','ग्रेजुएट शिक्षण सहायक','ग्लास काटना मशीन ऑपरेटर',
        'घड़ी मरम्मतकर्ता','घर के लिए स्वास्थ्य सहायक','घर साफ़ करने वाला','घरेलू उपकरण इंस्टालर','घरेलू उपकरण मरम्मतकर्ता',
        'चक्की','चढ़ाना ऑपरेटर','चालक-बिक्री कार्यकर्ता','चिकित्सक','चिकित्सकीय प्रयोगशाला तकनीशियन','चिकित्सा उपकरण मरम्मतकर्ता','चिकित्सा तकनीशियन','चिकित्सा वैज्ञानिकों','चिकित्सा सचिव','चिकित्सा सहायक','चित्रकार','चित्रकारी मशीन ऑपरेटर','चिपकाने मशीन ऑपरेटर','चौकीदार',
        'छत टाइल इंस्टालर','छपाई मशीन ऑपरेटर','छिड़कना ऑपरेटर','छिड़काव मशीन ऑपरेटर',
        'जन संपर्क प्रबंधक','जन स्वास्थ्य सामाजिक कार्यकर्ता','जवाब सेवा','जस्ता कास्टर','जहाज इंजीनियर','जहाज का कप्तान','जहाज़ पर का माल उतारने-चढ़ानेवाला','जहाज पायलट','जहाज बढ़ई और योजक','जहाज मेट्स','जानवरों का प्रशिक्षक','जासूसी','जिल्द कार्यकर्ता','जिल्द मशीन ऑपरेटर','जिल्दसाज','जीव - चिकित्सा इंजीनियर','जीवन विज्ञान तकनीशियन','जीवन वैज्ञानिकों','जीवनरक्षक','जीवभौतिकीवेत्ता','जीवविज्ञानी','जीवाणुतत्ववेत्त','जूता और चमड़ा मरम्मतकर्ता','जूता मशीन ऑपरेटर्स','जैव विज्ञान शिक्षक','जैविक तकनीशियन','जैविक वैज्ञानिक','जौहरी',
        'टंकित मशीन ऑपरेटर','टाइप बैठनेवाला','टाइल सेटर','टांका मशीन सेटर','टायर परिवर्तक','टायर बिल्डर','टिकट दलाल','टीएसए','टीम असेंबलर','टुकड़े टुकड़े हो जाना','टूर गाइड','टेलर','टेलीफोन ऑपरेटर','टेलीफोन स्टेशन इंस्टालर और मरम्मतकर्ता','टेलीमार्केटर','टैंक कार','टैक्स परीक्षक','टैक्सी ड्राइवर और चालक','ट्रक चालक','ट्रांजिट पुलिस','ट्रांसफार्मर मरम्मतकर्ता','ट्रेन चालक दल','ट्रेनर','ट्रैक स्विच मरम्मतकर्ता','ट्रैक्टर ऑपरेटर','ट्रैक्टर-ट्रेलर ट्रक ड्राइवर','ट्रैवल एजेंट',
        'डाक बाबू','डाक भेजने वाला','डाक सेवा क्लर्क','डाक सेवा डाक वाहक','डाक सेवा मेल सॉर्टर','डाटा प्रोसेसिंग उपकरण मरम्मतकर्ता','डाटाबेस प्रबंधक','डायमंड कार्यकर्ता','डिजाइनर','डिवाइस असेम्बलर्स समय','डिस्पैचर','डीजल इंजन विशेषज्ञ','डेकोरेटर','डेटाबेस व्यवस्थापक','डेस्कटॉप पब्लिशर','डै्रगलाइन ऑपरेटर','डॉट नक़्क़ाश','ड्राई क्लीनिंग कार्यकर्ता','ड्रिलिंग और बोरिंग मशीन उपकरण सेटर',
        'ढांचा खड़ा करनेवाला','ढालना बनाने',
        'तकनीकी कार्यक्रम प्रबंधक','तकनीकी निदेशक','तकनीकी लेखक','तकनीकी विशेषज्ञ','तथ्य दाखिला प्रचालक','तबला मरम्मतकर्ता','ताप और एयर कंडीशनिंग मैकेनिक','तारवाला साधन मरम्मतकर्ता और ट्यूनर','तेल और गैस ऑपरेटर','तेल सर्विस यूनिट ऑपरेटर','त्वचा की देखभाल विशेषज्ञ',
        'थियेटर निदेशक','थोक खरीदार',
        'दंत चिकित्सक','दंत चिकित्सा सहायक','दंत स्वास्थिक','दबाकर मशीन ऑपरेटर','दबाव पोत इंस्पेक्टर','दरवाजा बिक्री के लिए दरवाजे','दर्जी','दर्शन और धर्म शिक्षक','दाई','दावा परीक्षक','दावा लेने वाला','दावों समायोजक','दुभाषिया','दुर्दम्य सामग्री मरम्मतकर्ता','दूरसंचार उपकरण इंस्टालर','दूरसंचार लाइन इंस्टालर','दूरसंचार सुविधा परीक्षक','दृश्य डिजाइनर','दृश्य-श्रव्य संकलन विशेषज्ञ',
        'धातु कार्यकर्ता','धातु फ़ेब्रिकेटर','धातु मोल्डिंग ऑपरेटर','धातु-रिफाइनिंग भट्ठी संचालक','धार्मिक कार्यकर्ता','धोखाधड़ी अन्वेषक','ध्वनि इंजीनियरिंग तकनीशियन',
        'नए खाते क्लर्क','नक़्क़ाश','नक़्क़ाश और उत्कीर्णक','नगर अग्निशमन पर्यवेक्षक','नगर आग सेनानी','नगर क्लर्क','नगर नियोजन के सहयोगी','नगर न्यायालय क्लर्क','नर्तकी','नर्सरी कार्यकर्ता','नर्सरी प्रबंधक','नर्सिंग प्रशिक्षक','नर्सिंग सहयोगी','नलकार','नलसाज','नाई','नाव बिल्डर और शिपराइट','नाविक','निजी क्षेत्र के कार्यकारी','निजी घरेलू कुक','निजी जासूस और अन्वेषक','निजी प्रशिक्षक','निदेशक धार्मिक क्रियाएँ','निदेशक मंडल','नियंत्रण वाल्व इंस्टालर','नियामक मरम्मतकर्ता','निर्देशात्मक समन्वयक','निर्देशिका सहायता ऑपरेटर','निर्धारित करना-आउट कार्यकर्ता','निर्माण','निर्माण उपकरण ऑपरेटर','निर्माण प्रबंधक','निर्माण बढ़ई','निर्माण बरमे','निर्माण मजदूर','निर्माताओं और निर्देशक','निर्मित भवन इंस्टालर','निश्चेतना विशेषज्ञ','निष्कर्षण कार्यकर्ता','नेटवर्क व्यवस्थापक','नेटवर्क सिस्टम विश्लेषक','नेत्र प्रयोगशाला तकनीशियन','नैदानिक ​​प्रयोगशाला तकनीशियन','नैदानिक ​​मनोचिकित्सक','नौकर','नौकरानी','नौकरी प्रिंटर','नौसेना आर्किटेक्ट्स','न्यायाधीश','न्यायालय लिपिक','न्यूक्लियर चिकित्सा टेक्नोलॉजिस्ट','न्यूमेरिकल उपकरण प्रोग्रामर','न्यूमेरिकल नियंत्रण मशीन उपकरण ऑपरेटर',
        'पकड़','पंच','पंजीकृत नर्स','पत्राचार क्लर्क','पम्प ऑपरेटर','परमाणु इंजीनियर','परमाणु उपकरण ऑपरेशन तकनीशियन','परमाणु ऊर्जा रिएक्टर ऑपरेटर','परमाणु तकनीशियन','परमाणु निगरानी तकनीशियन','परामर्शदाता','परिदृश्य वास्तुकार','परिधान','परिवहन उपकरण चित्रकारों','परिवहन उपकरण रखरखाव','परिवहन और सामग्री-स्थानांतरण','परिवहन कार्यकर्ता','परिवहन टिकट एजेंट','परिवहन निरीक्षक','परिवहन परिचर','परिवहन प्रबंधक','परिवीक्षा अधिकारी और सुधारक उपचार विशेषज्ञ','परीक्षक और इंस्पेक्टर लाइसेंसिंग','पर्यवेक्षक अग्निरोधक कार्यकर्ता','पर्यवेक्षक सुधारक अधिकारी','पर्यावरण अनुपालन इंस्पेक्टर','पर्यावरण अभियान्ता','पर्यावरण इंजीनियरिंग तकनीशियन','पर्यावरण विज्ञान तकनीशियन','पर्यावरण विज्ञान शिक्षक','पर्यावरण वैज्ञानिक','पर्सनल केयर कार्यकर्ता','पवन साधन मरम्मतकर्ता','पशु की देखभाल श्रमिक','पशु चिकित्सा तकनीशियन','पशु चिकित्सा सहायक','पशु नियंत्रण कार्यकर्ता','पशु ब्रीडर','पशु वैज्ञानिक','पशुचिकित्सा','पशुपालन कार्यकर्ता','पाइप का लेयर','पाइपलाइन बिछा देने का कार्य फिटर','पाइल चालक ऑपरेटर','पात्रता साक्षात्कारकर्ता','पादरी','पार्क प्रकृतिवादी','पार्किंग प्रवर्तन कार्यकर्ता','पार्किंग स्थल परिचर','पार्ट्स विक्रेता','पाल बिल्डर','पालिशगर','पावर जेनरेटिंग प्लांट ऑपरेटर','पावर प्लांट ऑपरेटर','पावर वितरक','पी.आर. मैनेजर','पीस मशीन ऑपरेटर','पुनर्नवीनीकरण सामग्री कलेक्टर','पुनर्वास काउंसेलर','पुरातत्त्ववेत्ता','पुरालेखपाल','पुलिस और नगर निरीक्षक गश्ती अधिकारी','पुलिस गुप्तचर','पुलिस पर्यवेक्षक','पुलिस पहचान','पुष्प डिजाइनर','पुस्तकालय अध्यक्ष','पुस्तकालय सहायक','पूर्वस्कूली शिक्षक','पृथ्वी बरमे','पेंटर और इलस्ट्रेटर','पेट्रोलियम अभियंता','पेट्रोलियम तकनीशियन','पेट्रोलियम पम्प ऑपरेटर','पेट्रोलियम पम्प सिस्टम ऑपरेटर','पेशेवर फोटोग्राफर','पेस्ट-अप कार्यकर्ता','पेस्ट्री शेफ','पैकेजिंग मशीन ऑपरेटर','पैदल सेना','पैदल सेना अधिकारी','पोडियाट्रिस्ट','पोर्टेबल पावर उपकरण मरम्मतकर्ता','पोल्ट्री कटर','पोषण विशेषज्ञ','पोस्टमास्टर','प्रक्रिया नियंत्रण प्रोग्रामर','प्रचार प्रबंधक','प्रचालन तंत्रविशेषज्ञ','प्रतिभा अधिग्रहण के निदेशक','प्रतिभा अधिग्रहण प्रबंधक','प्रतिभा निदेशक','प्रतिभूति बिक्री एजेंट','प्रतिमान निर्माता','प्रदर्शनी डिजाइनर','प्रबंधक सामरिक संचालन','प्रबंधन विश्लेषक','प्रयोक्ता अनुभव प्रबंधक','प्रयोक्ता अनुभव शोधकर्ता','प्रयोगशाला पशु कार्यवाहक','प्रशासनिक कानून न्यायाधीश','प्रशासनिक सहायता पर्यवेक्षकों','प्रशासनिक सेवा प्रबंधक','प्रशिक्षण प्रबंधक','प्रशीतन मैकेनिक','प्रसारण तकनीशियन','प्राकृतिक विज्ञान प्रबंधक','प्राणि','प्राथमिक और माध्यमिक विद्यालय व्यवस्थापकों','प्राथमिक विद्यालय शिक्षक','प्रिंटिंग प्रेस मशीन ऑपरेटर','प्रीस्कूल शिक्षा व्यवस्थापकों','प्रेस मशीन सेटर, ऑपरेटर','प्रेसिजन डायर','प्रेसिजन डिवाइस इंस्पेक्टर','प्रेसिजन ढालना और पैटर्न कास्टर','प्रेसिजन नक़्क़ाश और उत्कीर्णक','प्रेसिजन पैटर्न और कास्टर मरो','प्रेसिजन मुद्रण कार्यकर्ता','प्रेसिजन लेंस ग्राइंडर और पालिशगर','प्रेसिजन विमान सिस्टम असेम्बलर्स','प्रेसिजन साधन मरम्मतकर्ता','प्रोजेक्ट मैनेजर','प्रोफ़ेसर','प्लास्टर मेसन','प्लास्टिक मोल्डिंग मशीन ऑपरेटर','प्लेट परिष्कृत करने वाला','प्लेटिंग मशीन ऑपरेटर',
        'फर्नीचर परिष्कृत करने वाला','फ़र्श उपकरण ऑपरेटर','फाइबर उत्पाद काटना मशीन ऑपरेटर','फ़ाइल लिपिक','फायर अलार्म सिस्टम इंस्टालर','फार्म इक्विपमेंट मैकेनिक','फार्मेसिस्ट','फार्मेसी तकनीशियन','फार्मेसी सहयोगी','फास्ट फूड कुक','फिटनेस ट्रेनर','फिटर','फिल्म निर्देशक','फिल्म प्रयोगशाला तकनीशियन','फैशन डिजाइनर','फैशन मॉडल','फोटोग्राफर','फोटोग्राफिक डेवलपर','फोटोग्राफिक प्रक्रिया कार्यकर्ता','फोटोग्राफिक प्रजनन तकनीशियन','फोटोग्राफिक प्रसंस्करण मशीन ऑपरेटर','फोटोग्राफिक बहाल करने वाला','फोरेंसिक अन्वेषक','फोरेंसिक विज्ञान तकनीशियन','फोर्जिंग मशीन सेटर','फ्रेट इंस्पेक्टर','फ्रेट एजेंट','फ़्लाइट अटेंडेंट',
        'बख़्तरबंद हमला वाहन अधिकारी','बख़्तरबंद हमला वाहन चालक दल सदस्य','बच्चे की देखभाल करने वाला कार्यकर्ता','बजट विश्लेषक','बढ़ई','बढ़ई असेंबलर और मरम्मतकर्ता','बदलाव दर्जी','बनाने मशीन ऑपरेटर','बर्तन साफ़ करने वाला','बलिष्ठ प्रशिक्षक','बस चालक','बहीखाता लिखनेवाला','बागवानी कार्यकर्ता','बाज़ार अनुसंधान विश्लेषक','बाड़ निर्माता','बायोकेमीज्ञानी','बारटेंडर हेल्पर','बाल देखभाल','बाल-रोग विशेषज्ञ','बालवाड़ी शिक्षक','बिक्री और संबंधित श्रमिक','बिक्री प्रतिनिधि','बिक्री प्रबंधक','बिजनेस ऑपरेशंस विशेषज्ञ','बिजली मिस्त्री','बिल और खाता कलेक्टर','बिल्डिंग इंस्पेक्टर','बिल्डिंग सफाई कार्यकर्ता','बीमा अन्वेषक','बीमा दावा क्लर्क','बीमा पॉलिसी प्रसंस्करण क्लर्क','बीमा बिक्री एजेंट','बीमा मूल्यांकक','बीमा हामीदार','बुलडोजर ऑपरेटर','बेकर, नानबाई','बैटरी मरम्मतकर्ता','बॉयलर ऑपरेटर','ब्रिज निविदा','ब्रेक मशीन सेटर','ब्रेज़िंग मशीन ऑपरेटर','ब्रॉडकास्ट न्यूज़ विश्लेषक','ब्रोकरेज क्लर्क',
        'भट्ठी संचालक','भण्डारण प्रबंधक','भर्ती','भारी उपकरण मैकेनिक','भाषण भाषा रोगविज्ञानी','भूगर्भ जलशास्त्री','भूगोल शिक्षक','भूगोलिक','भूदृश्य','भूदृश्य का चित्रण','भूमिगत खनन','भूविज्ञानी','भूवैज्ञानिक इंजीनियर','भूवैज्ञानिक डाटा तकनीशियन','भूवैज्ञानिक नमूना टेस्ट तकनीशियन','भूवैज्ञानिकों','भोजन तैयार करने और परोसने वाले कार्यकर्ता','भोजन तैयार करने के प्रबंधक','भोजन तैयार कार्यकर्ता','भौजनशाला का नौकर','भौतिक चिकित्सक','भौतिक विज्ञान के अध्यापक','भौतिक विज्ञानी',
        'मछली गेम वार्डन','मछली पकड़ना','मछली हैचरी प्रबंधक','मंजिल परत','मंजिल परिष्कृत करने वाला','मत्स्य कार्यकर्ता','मध्य विद्यालय शिक्षक','मनोचिकित्सक','मनोरंजन और कलाकार','मनोरंजन और स्वास्थ्य अध्ययन शिक्षक','मनोरंजन कार्यकर्ता','मनोरंजन परिचर','मनोरंजन वाहन सेवा तकनीशियन','मनोरंजनात्मक चिकित्सक','मनोरोग तकनीशियन','मनोरोग सहयोगी','मनोविज्ञान शिक्षक','मनोविज्ञानी','मनोवैज्ञानिक परामर्श','मरम्मत करनेवाला','मल्टी मीडिया कलाकार','मशीन उपकरण ऑपरेटर','मशीन ऑपरेटरों को अलग','मशीन फीडर','मशीन लोड हो रहा है ऑपरेटर','मशीनरी रखरखाव','महाप्रबंधक','महामारी','महाराज','मादक द्रव्यों के सेवन काउंसलर','मादक द्रव्यों के सेवन सामाजिक कार्यकर्ता','माध्यमिक विद्यालय शिक्षक','मानचित्रण तकनीशियन','मानव विज्ञान शिक्षक','मानव संसाधन के उपाध्यक्ष','मानव संसाधन निदेशक','मानव संसाधन प्रबंधक','मानव संसाधन विशेषज्ञ','मानव संसाधन सहायक','मानवविज्ञानी','मानसिक स्वास्थ्य काउंसेलर','माल ढुलाई और सामग्री मूवर','मालिश चिकित्सक','मांस पैकर','मिट्टी संरक्षणवादी','मिलिंग मशीन ऑपरेटर','मिश्रण और मशीन ऑपरेटर सम्मिश्रण','मिस्त्री','मीटर मैकेनिक','मीडिया और संचार कार्यकर्ता','मुआवजा और लाभ प्रबंधक','मुनीम','मुंशी','मूवर्स','मृदा वैज्ञानिक','मेकअप कलाकार','मेकेनिक','मेजबान और परिचारिका','मेडिकल उपकरण तकनीशियन','मेडिकल ट्रांसक्रिप्शनिस्ट','मेडिकल प्रयोगशाला टेक्नोलॉजिस्ट','मेडिकल बिक्री प्रतिनिधि','मेडिकल रिकॉर्ड्स तकनीशियन','मेरा काटना मशीन ऑपरेटर','मेल मशीन ऑपरेटर','मैकेनिकल इंजीनियरिंग तकनीशियन','मैदान रखरखाव कार्यकर्ता','मैनेजर','मॉडल निर्माता','मोटर वाहन ऑपरेटर','मोटर वाहन ग्लास इंस्टॉलर','मोटर वाहन तकनीशियन','मोटर वाहन निरीक्षक','मोटर वाहन मास्टर मैकेनिक','मोटर वाहन मैकेनिक','मोटर वाहन विशेषता तकनीशियन','मोटर वाहन शरीर मरम्मतकर्ता','मोटरबोट ऑपरेटर','मोटरबोट मैकेनिक','मोटरसाइकिल मैकेनिक','मोल्ड निर्माता','मोल्डिंग और कास्टिंग कार्यकर्ता','मोल्डिंग मशीन ऑपरेटर','मोशन पिक्चर प्रोजेक्शनिस्ट','मौखिक सर्जन',
        'यंत्र चालक','यातायात तकनीशियन','यात्रा दिग्दर्शक','यांत्रिक इंजीनियर','यांत्रिक इंस्पेक्टर','यांत्रिक उपकरण बिक्री प्रतिनिधि','यांत्रिक दरवाजा मरम्मतकर्ता','यांत्रिक प्रारूपक',
        'रखरखाव उपकरण ऑपरेटर','रखरखाव और मरम्मत कार्यकर्ता','रखरखाव कर्मी','रखरखाव पर्यवेक्षक','रडार तकनीशियन','रसायन विज्ञान शिक्षक','रसायनज्ञ','रसोइया','राज','राजनीति विज्ञान शिक्षक','राजनैतिक वैज्ञानिक','राजमार्ग गश्ती पायलट','राजमार्ग रखरखाव कार्यकर्ता','राज्य','रात की पाली','रात सुरक्षा गार्ड','रासायनिक इंजीनियर','रासायनिक उपकरण ऑपरेटर','रासायनिक उपकरण नियंत्रक','रासायनिक उपकरण निविदा','रासायनिक तकनीशियन','रासायनिक संयंत्र ऑपरेटर','रिकार्ड क्लर्क','रिकॉर्डकीपिंग क्लर्क','रिकॉर्ड्स अधिकारी','रिजर्वेशन कराने वाला एजेंट','रिफाइनरी ऑपरेटर','रियल एस्टेट एसोसिएशन प्रबंधक','रियल एस्टेट बिक्री एजेंट','रियल एस्टेट ब्रोकर','रिसेप्शनिस्ट और सूचना क्लर्क','रेंज प्रबंधक','रेंटल क्लर्क','रेडियो आपरेटर','रेडियो और टेलीविजन उद्घोषक','रेडियो मैकेनिक','रेल इंस्पेक्टर','रेल कार मरम्मतकर्ता','रेल चालक','रेल परिवहन कार्यकर्ता','रेल पुलिस','रेल यार्ड इंजीनियर','रेल यार्ड कार्यकर्ता','रेल स्विच ऑपरेटर','रेस्टोरेंट कुक','रॉक स्प्लिटर','रोजगार साक्षात्कारकर्ता','रोटरी ड्रिल ऑपरेटर','रोलिंग मशीन सेटर',
        'लकड़ी मशीन ऑपरेटर','लकड़ी मशीन सेटर','लघु आदेश कुक','लाइब्रेरी कार्यकर्ता','लाइब्रेरी तकनीशियन','लाइब्रेरी साइंस टीचर','लाइसेंस क्लर्क','लागत आकलनकर्ता','लाभ विशेषज्ञ','लिफ्ट इंस्टालर और मरम्मतकर्ता','लेखक','लेखा परीक्षक','लेपक','लैंडस्केप कलाकार','लॉक निविदा','लॉकर रूम अटेंडेंट','लॉगिंग उपकरण ऑपरेटर','लॉगिंग कार्यकर्ता','लॉगिंग ट्रैक्टर ऑपरेटर','लॉगिंग पर्यवेक्षक','लॉन सेवा प्रबंधक','लोकोमोटिव इंजीनियर',
        'वकील','वक्तव्य क्लर्क','वन अग्निरोधक पर्यवेक्षक','वन आग निरीक्षक','वन आग सेनानी','वन और संरक्षण कार्यकर्ता','वन और संरक्षण तकनीशियन','वनवासी','वन्यजीव जीवविज्ञानी','वर्ड प्रोसेसर और टाइपिस्ट','वस्त्र काटना मशीन ऑपरेटर','वस्त्र कार्यकर्ता','वस्त्र डाइंग मशीन ऑपरेटर','वस्त्र बुनाई मशीन ऑपरेटर','वस्त्र मशीन ऑपरेटर','वाणिज्यिक और औद्योगिक डिजाइनर','वाणिज्यिक गोताखोर','वानिकी पर्यवेक्षक','वानिकी संरक्षण विज्ञान शिक्षक','वायुमंडलीय और अंतरिक्ष वैज्ञानिक','वाल्व मरम्मतकर्ता','वाशिंग उपकरण ऑपरेटर','वास्तुकला प्रारूपक','वास्तुकला शिक्षक','वास्तुकार','वाहन के क्लीनर','विकास प्रबंधक','विकिरण चिकित्सक','विकिरणित ईंधन हैंडलर','विक्रेता की','विज्ञान मात्रा विज्ञान शिक्षा व्यवस्थापकों','विज्ञापन प्रबंधक','विज्ञापन बिक्री एजेंट','विडियो संपादक','वितरण प्रबंधक','वित्तीय परीक्षक','वित्तीय प्रबंधक','वित्तीय विशेषज्ञ','वित्तीय विश्लेषक','वित्तीय सेवा सेल्स एजेंट','विदेशी भाषा अध्यापक','विद्युत इंजीनियर','विद्युत उपकरण असेंबलर','विद्युत पावर लाइन इंस्टालर','विद्युत प्रारूपक','विद्युत बिक्री प्रतिनिधि','विद्युत्-प्लेटिंग मशीन ऑपरेटर','विधायक','विनिर्माण बिक्री प्रतिनिधि','विपणन उपाध्यक्ष','विपणन का निदेशक','विपणन के उपाध्यक्ष','विपणन प्रबंधक','विमान अभियंता','विमान असेंबलर','विमान इंजन विशेषज्ञ','विमान कार्गो हैंडलिंग पर्यवेक्षक','विमान की शुरुआत और वसूली अधिकारी','विमान यांत्रिकी','विमान लॉन्च विशेषज्ञ','विमान शरीर मरम्मतकर्ता','विमान संरचना असेम्बलर्स','विमान सेवा तकनीशियन','विमान हेराफेरी असेंबलर','विमानन इंस्पेक्टर','विशेष आभ्यासिक गुरु','विशेष बल','विशेष बलों अधिकारी','विश्वविद्यालय','विस्फोटक विशेषज्ञ','वेटर','वेट्रेस','वेतनभोगी लिपिक','वेब डेवलपर','वेबमास्टर','वेल्डर','वेल्डर और कटर','वेल्डर-फिटर','वेल्डिंग मशीन ऑपरेटर','वेल्डिंग मशीन निविदा','वेल्डिंग मशीन सेटर','वैकल्पिक चिकित्सक सहयोगी','वैकल्पिक चिकित्सक सहायक','वैज्ञानिक फोटोग्राफर','वैमानिकी तकनीशियन','व्यक्तिगत वित्तीय सलाहकार','व्यक्तिगत सेवा कार्यकर्ता','व्यक्तिगत होम केयर सहयोगी','व्यवसाय प्रबंधक','व्यवसाय विकास के निदेशक','व्यवसाय विकास प्रबंधक','व्यवस्थापक','व्यापार शिक्षक','व्यावसायिक चिकित्सक','व्यावसायिक वायुयान चालक','व्यावसायिक शिक्षा शिक्षक','व्यावसायिक स्वास्थ्य सुरक्षा तकनीशियन','व्यावसायिक स्वास्थ्य सुरक्षा विशेषज्ञ',
        'शंकु','शटल कार ऑपरेटर','शल्य चिकित्सक','शहर','शहरी योजनाकार','शादी और परिवार चिकित्सक','शारीरिक चिकित्सक सहयोगी','शारीरिक चिकित्सक सहायक','शारीरिक वैज्ञानिक','शिक्षा शिक्षक','शिपिंग और प्राप्त करना क्लर्क','शीट मेटल कर्मचारी','शीतलक और बर्फ़ीली उपकरण ऑपरेटर','शीर्षक खोजकर्ता','शीर्षक परीक्षक','शेयर क्लर्क','शेयर ब्रोकर','शेरिफ','शैक्षिक मनोवैज्ञानिक','श्रमजीवी धोड़ा','श्वसन चिकित्सक','श्वसन थेरेपी तकनीशियन',
        'संक्षिप्त करने मशीन ऑपरेटर','संगठनात्मक विकास प्रबंधक','संगतराश','संगमरमर सेटर','संगीत निर्देशक','संगीत वाद्य यंत्र ट्यूनर','संगीतकार','संग्रहालय संरक्षक','संचार उपकरण ऑपरेटर','संचार उपकरण कार्यकर्ता','संचार उपकरण मरम्मतकर्ता','संचार शिक्षक','संचालन अनुसंधान विश्लेषक','सचिव','सतत खनन मशीन ऑपरेटर','संदेशवाहक','संपादक','सफर क्लर्क','सबस्टेशन रखरखाव','समर्थ नाविक','समाज सेवक','समाज सेवा विशेषज्ञ','समाजशास्त्र शिक्षक','समाजशास्त्री','समान अवसर प्रतिनिधि','समायोजन क्लर्क','समुद्री इंजीनियर','समुद्री ओइलर','समुद्री कार्गो इंस्पेक्टर','समुद्री वास्तुकार','संयंत्र और सिस्टम ऑपरेटर','संयंत्र वैज्ञानिक','सरकार','सरकार संपत्ति इंस्पेक्टर','सरकारी सेवा कार्यकारी','संरक्षण वैज्ञानिक','सर्जिकल टेक्नोलॉजिस्ट','सर्विस स्टेशन परिचर','सर्वेक्षण और मानचित्रण तकनीशियन','सर्वेक्षण तकनीशियन','सर्वेक्षण शोधकर्ता','सर्वेयर','संवाददाता','संवाददाताओं से','सह पायलट','सहायक अध्यापक','सहायक उपकरण ऑपरेटर','सहायक चिकित्सक','साइकिल मरम्मतकर्ता','साक्षात्कारकर्ता','सांख्यिकीय सहायक','सांख्यिकीविद','साधन बिक्री प्रतिनिधि','सामग्री इंजीनियर','सामग्री इंस्पेक्टर','सामग्री कार्यकर्ता आगे बढ़ते','सामग्री मूवर्स','सामग्री वैज्ञानिक','सामाजिक और मानव सेवा सहायक','सामाजिक कार्य शिक्षक','सामाजिक मीडिया विपणन के निदेशक','सामाजिक मीडिया विपणन प्रबंधक','सामाजिक विज्ञान अनुसंधान सहायक','सामाजिक विज्ञान शिक्षक','सामाजिक वैज्ञानिकों','सामान्य चिकित्सक','सामुदायिक सेवा प्रबंधक','सार्वजनिक परिवहन निरीक्षक','सार्वजनिक संबंधो के विशेषज्ञ','सांस्कृतिक अध्ययन शिक्षक','सिग्नल मरम्मतकर्ता','सिलाई मशीन ऑपरेटर','सिविल अभियंता','सिविल इंजीनियरिंग तकनीशियन','सिविल प्रारूपक','सी ई ओ','सीएफओ','सीएसआई','सीटीओ','सीमा शुल्क निरीक्षक','सीमेंट मेसन और कंक्रीट परिष्कृत करने वाला','सीसीसी','सुधारक अधिकारी','सुनार','सुरक्षा कर्मी','सुरक्षा प्रणाली इंस्टालर','सुरक्षा यंत्री','सुरक्षा सेवा कार्यकर्ता','सूचना प्रणाली प्रबंधक','सेट और प्रदर्शनी डिजाइनर','सेट डिजाइनर','सेमीकंडक्टर प्रोसेसर','सेल्स इंजीनियर','सैन्य अफसर','सॉफ्टवेयर इंजीनियर','सोफ़ासाज़','स्कूल बस चालक','स्कूल सामाजिक कार्यकर्ता','स्केच कलाकार','स्कैनर ऑपरेटर','स्क्रीन प्रिंटिंग मशीन ऑपरेटर','स्टाफ मनोवैज्ञानिक','स्टेशनरी इंजीनियर','स्टोन कटर','स्टोन सॉयर','स्ट्रक्चरल आयरन एंड स्टील कार्यकर्ता','स्ट्रक्चरल धातु फ़ेब्रिकेटर','स्ट्रीटकार ऑपरेटर','स्थापना और मरम्मत तकनीशियन','स्पॉटर','स्पोर्ट्स बुक लेखक','स्लॉट कुंजी व्यक्ति','स्व संवर्धन शिक्षा शिक्षक','स्वास्थ्य टेक्नोलॉजिस्ट','स्वास्थ्य देखभाल','स्वास्थ्य विशेषता शिक्षक','स्वास्थ्य व्यवसायी','स्वास्थ्य शिक्षक','स्वास्थ्य सेवा प्रबंधक',
        'हंटर और ट्रैपर','हथियार विशेषज्ञ','हथियार विशेषज्ञ के प्रबंधक','हवाई यातायात नियंत्रक','हाउसकीपर','हाड वैद्य','हाथ कोल्हू','हाथ सीवर','हीट ट्रीटिंग उपकरण ऑपरेटर','हीटर','हीटिंग उपकरण ऑपरेटर','हृदय टेक्नोलॉजिस्ट','हेड नर्स','हेल्थकेयर व्यवसायी','हेल्थकेयर सहायता कार्यकर्ता','होटल डेस्क क्लर्क','होम','होम इकोनॉमिक्स शिक्षक','होम एंटरटेनमेंट उपकरण इंस्टालर','होमलैंड सुरक्षा',
    );

    protected static $companySuffix = array('निगम', 'और बेटे', 'एलएलसी', 'समूह', 'पीएलसी', 'लिमिटेड');

    /**
     * @example 'चरणबद्ध दिशात्मक ढांचा'
     */
    public function catchPhrase()
    {
        $result = array();
        foreach (static::$catchPhraseWords as &$word) {
            $result[] = static::randomElement($word);
        }

        return join(' ', $result);
    }

    /**
     * @example 'रणनीति धनी बाजार'
     */
    public function bs()
    {
        $result = array();
        foreach (static::$bsWords as &$word) {
            $result[] = static::randomElement($word);
        }

        return join(' ', $result);
    }
}
