<?php

namespace Faker\Provider\hi_IN;

class Lorem extends \Faker\Provider\Lorem
{
    public static function sentence($nbWords = 6, $variableNbWords = true)
    {
        return self::english2HindiFullStop(parent::sentence($nbWords, $variableNbWords));
    }

    public static function text($maxNbChars = 200)
    {
        return self::english2HindiFullStop(parent::text($maxNbChars));
    }

    private static function english2HindiFullStop($text)
    {
        return (substr($text, -1) == '.') ? substr($text, 0, strlen($text) - 1) . '।' : $text;
    }

    protected static $wordList = array(
        '२४भि','७हल',
        'अगर नहीं','अधिक','अधिक','अधिकार','अधिकांश','अधिकांश','अधिकांश','अनुकूल','अनुकूल','अनुवाद','अनुवाद','अनुवादक','अनुवादक','अनुवादक','अन्तरराष्ट्रीयकरन','अन्तरराष्ट्रीयकरन','अन्य','अन्य','अन्य','अपनि','अपनि','अपने','अब','अमितकुमार','अमितकुमार','अमितकुमार','अमेट','अर्थपुर्ण','अर्थपुर्ण','अर्थपुर्ण','अर्ध','अविरोधता','अविरोधता','असक्षम','असक्षम','असक्षम','असक्षम','असरकारक',
        'आईडी','आजपर','आजपर','आंतरकार्यक्षमता','आंतरकार्यक्षमता','आंतरकार्यक्षमता','आंतरजाल','आधुनिक','आधुनिक','आधुनिक','आपके','आपको','आपको','आपको','आपको','आवश्यक','आवश्यक','आवश्यक','आवश्यकत','आवश्यकत','आवश्यकत','आवश्यकत',
        'ईए','ईलुम',
        'उदेशीत','उद्योग','उद्योग','उद्योग','उनके','उनके','उनके','उनको','उनको','उपनाम','उपलब्ध','उपलब्ध','उपलब्ध','उपलब्धता','उपेक्ष','उल्लम','उशकी','उसके','उसीएक्',
        'ऋण',
        'ए','एक द्रव','एछित','एछित','एट','एसईडी','एसलिये','एसेएवं','एसेएवं',
        'और्४५०','औषधिक','औषधिक','औषधिक','औषधिक',
        'अंग्रेजी','अंतर्गत','अंतर्गत',
        'कम्प्युटर','करके','करके(विशेष','करता','करने','कराना','कराना','कराना','करेसाथ','कर्मचारी','कर्य जानकारी','कर्य','कलइस','कलइस','कलइस','कलइस','कलइस','काम','काम','काम','कार्य','कार्यलय','कार्यसिधान्तो','कीने मजबुत','कुई','कुछ समय के लिये','कुशलता','कुशलता','के लिए सबसे अच्छा','केवल','कैसे','कॉर्पोरिस','कोहम','कोहम','कोहम','क्षमता','क्षमता','क्षमता','क्षमता',
        'खयालात','खयालात',
        'गएआप','गटकउसि','गटकउसि','गटको','गयेगया','गयेगया','गुजरना','गैर','गोपनीयता',
        'चाहे','चिदंश','चिदंश','चुनने','चुनने','चुनने','चौकस',
        'जनित','जागरुक','जागरुक','जाता','जानकारी','जानकारी','जानकारी','जानते','जानते','जानते','जाने','जिम्मे','जिम्मे','जिवन','जिवन','जिवन','जिवन','जिवन','जिसकी','जेल में डालना','जैसी','जैसी','जैसे','ज्यादा','ज्यादा',
        'डाले',
        'ढांचा','ढांचा','ढांचा','ढांचा','ढांचामात्रुभाषा','ढांचामात्रुभाषा','ढांचामात्रुभाषा',
        'तकरीबन','तरहथा','तरहथा','तरहथा','तरहथा','तरहथा','तरहथा','तरहथा','तरहथा','तरीके','तरीके','तरीके','त्रुटि',
        'थातक',
        'दर्शाता','दस्तावेज','दुनिया','दुनिया','दुनिया','देखने','देखने','देते','देते','दौरान','दौरान','दौरान','दौरान','द्वारा','द्वारा',
        'ध्येय','ध्येय','ध्वनि',
        'नवंबर','निमो','निरपेक्ष','निरपेक्ष','निरपेक्ष','निरपेक्ष','निर्देश','निर्माण','निर्माता','निर्माता','निहिल','नोबिस','नोस्ट्रम','न्यूनतम',
        'पढाए','पर','परस्पर','परिभाषित','परिभाषित','परिभाषित','परिवहन','पहेला','पहोचाना','पहोचाना','पहोचाना','पासपाई','पुर्णता','पुर्णता','पुर्व','पुर्व','पुर्व','पुस्तक','पुस्तक','पुस्तक','पूछताछ','पोरो','प्रति कुशलता','प्रति','प्रति','प्रति','प्रतिबध','प्रतिबध','प्रतिबध','प्रदान','प्रदान','प्रमाद','प्रमान','प्रमान','प्रमान','प्रमान','प्रमान','प्राण','प्राण','प्राण','प्राण','प्राण','प्राण','प्राथमिक','प्राथमिक','प्राथमिक','प्राथमिक','प्राधिकरन','प्राप्त','प्रोत्साहित','प्रौध्योगिकी',
        'बढाता','बढाता','बनाए','बनाए','बनाकर','बनाकर','बनाकर','बनाना','बलवान','बहतर','बाजार अत्यंत','बाजार','बाटते','बाटते','बाटते','बाटते','बाटते','बातसमय','बातसमय','बातसमय','बारे','बारे','बारे','बिन्दुओ','बिन्दुओमे','बैठिये','ब्रौशर',
        'भागने','भाति','भाति','भारत कर्य','भारतीय','भारतीय','भाषए','भाषा','भाषाओ','भीयह','भूतपूर्व','भेदनक्षमता','भोगोलिक',
        'मर्यादित','मर्यादित','मर्यादित','मातम','मार्गदर्शन','मार्गदर्शन','मार्गदर्शन','माहितीवानीज्य','माहितीवानीज्य','माहितीवानीज्य','मुक्त','मुक्त','मुक्त','मुखय','मुखय','मुखय','मुखय','मुख्य','मुख्य','मुख्यतह','मुख्यतह','मुश्किल','मुश्किल','मुश्किल','मुश्किले','मुश्किले','मुश्किले','में','मेंभटृ','मेंभटृ','मेमत','मैक्सिमे','मैग्नि','मोदी',
        'यथास्थिति','यहाँ','यायेका देखने','यायेका','यायेका',
        'रखति','रखति','रखते','रखते','रचना','रचना','रहारुप','रहारुप','रिती','रेम',
        'लक्षण','लचकनहि','लाभान्वित','लाभान्वित','लाभान्वित','लिए','लिए','लिये','लिये','लिये','लेकिन','लेकिन','लेने','लेने','लोगो',
        'वर्णन','वर्णन','वर्णन','वर्णित','वर्णित','वर्णित','वर्तमान','वर्तमान','वर्तमान','वातावरण','वार्तालाप','वार्तालाप','वास्तव','वास्तव','वास्तविक','वास्तविक','वास्तविक','विकसित','विकासक्षमता','विकेन्द्रित','विचरविमर्श','विचरविमर्श','विचरविमर्श','विचरविमर्श','विचारशिलता','विचारशिलता','विज्ञान','विज्ञान','विज्ञापन','विनिमय','विभाग','विभाग','विभाग','विभाजनक्षमता','विभाजनक्षमता','विवरण','विवरन','विवरन','विशेष','विशेष','विश्व','विश्व','विश्वव्यापि','विश्वव्यापि','विश्वास','विषय','वेरो','वेल','वैश्विक','वैश्विक','वैश्विक','व्यवहार','व्यवहार','व्याख्या','व्याख्यान','व्रुद्धि','व्रुद्धि','व्रुद्धि',
        'शारिरिक','शीघ्र','शीघ्र','शीघ्र','शीघ्र','शुरुआत',
        'सकता','सकती','सकती','सक्षम','सक्षम','सदस्य','सदस्य','संदेश','संदेश','संपुर्ण','संपुर्ण','संपुर्ण','संभव','सभिसमज','सभिसमज','सभिसमज','सभीकुछ','समस्याए','समस्याए','समस्याए','समाज','समाजो','सम्पर्क','सम्पर्क','सम्पर्क','संसाध','संस्क्रुति','संस्था','संस्था','सह','सहयोग','सहयोग','सहयोग','सहायता','सहित','साधन','सारांश','सारांश','सार्वजनिक','सिद्धांत','सिद्धांत','सीमित','सीमित','सीमित','सुचना','सुचनाचलचित्र','सुचनाचलचित्र','सुचनाचलचित्र','सुनत','सुनत','सुनत','सुविधा','सुविधा','सुस्पश्ट','सुस्पश्ट','सेऔर','सेऔर','सोता','सोफ़तवेर','स्थापित','स्थापित','स्थिति','स्वतंत्र','स्वतंत्रता',
        'हमेहो','हमेहो','हार्डवेर लक्षण','हार्डवेर','हार्डवेर','हिंदी','ही','हुआआदी','हुआआदी','हुएआदि','है।अभी','है।अभी','हैं','होगा','होने','होने','होने','होसके','होसके','होसके','होसके',
    );
}
