<?php

namespace Faker\Provider\hi_IN;

class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{middleNameMale}} {{lastName}}',
        '{{firstNameMale}} {{firstNameMale}} {{lastName}}',
    );

    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{firstNameMale}} {{lastName}}',
    );

    protected static $titleMale = array(
        'श्री', 'श्रीमान', 'कुमार', 'मि.', 'डॉ.', 'प्रॉफ.',
    );

    protected static $titleFemale = array(
        'श्री', 'श्रीमती', 'कुमारी', 'मिस', 'डॉ.', 'प्रॉफ.',
    );

    protected static $firstNameMale = array(
        'अक्षय','अखिल','अजय','अजहर','अजिंक्य','अजीत','अतुल','अनिमेष','अनिरुद्ध','अनिल','अनीस','अब्दुल','अब्बास','अभिनव','अभिषेक','अमीर','अमृत','अरविंद','अरुण','अर्जुन','अर्पित','अल्बर्ट','असलम',
        'आतिफ','आदित्य','आदिल','आदिश','आनंद','आयुष्मान','आरिफ',
        'इकबाल','इकबाल','इब्राहिम','इमरान','इशांत',
        'उज्वल','उदय','उमर','उमर','उमेश','उस्मान',
        'ऋषिकेश',
        'एडी','एलियास','एलेक्स','एहसान',
        'ओबैद','ओवैस',
        'क़दीम','कबीर','क़बील','क़बूल','कमलेश','करीम','कल्पित','कल्याण','कार्तिक','कीर्ति','कुशल','कृष्णा','कैलाश','कौश्तुभ',
        'गजेन्द्र','गणेश','ग़ालिब','गियान','गुलजार','गोविंद','गौरव','गौरांश',
        'घनश्याम',
        'चरनदीप','चांद','चार्ली','चितरंजन','चिन्मय','चिराग',
        'जगत','जगदीश','जतिन','जमशेद','जवाहर','जसवंत','जहीर','ज़ाद','जावेद','जीशान','जैक','जॉन','जोबिन',
        'डेविड',
        'तनय','तरुण','ताबीद','ताहिद','तुषार',
        'दनिश','दर्पण','दिनेश','दीप','दीपेश','देवेंद्र',
        'धनुष','धीरज',
        'नकुल','नजीर','नटवर','नयन','नरेश','नवल','नवाब','नसीर','नारायण','नितिन','निर्मल','नीरेंद्र',
        'परवीन','परवेज','पीटर','पीरजादा','प्रणब','प्रणय','प्रदीप','प्रभात','प्रवीण','प्रसून','प्रीत',
        'फकरूदीन','फरदीन','फ़राज़','फिरोज','फैसल',
        'बलदेव','बहादुर','बाबेर','बालकृष्ण','बालाजी','बिजॉय','बिज्जू','बिनोद','बिनोय','बीरेन',
        'भारत','भोला',
        'मनप्रीत','मनीष','मनोज','मलिक','महमूद','मार्लो','मितेश','मुकुंद','मुकुल','मुनाफ','मुस्तफा','मेहुल','मोगली','मोती','मोनिन','मोहन','मोहन','मोहनलाल','मोहित',
        'यदु','यदुनंदन','यश','योगेश',
        'रतन','रमेश','रहमान','रहीम','राघवन','राज','राजू','राजेंद्र','राजेश','राधे','राधेश्याम','राम','रामगोपाल','राशिद','रिकी','रूपल','रूपेश',
        'लक्ष्मी','लबीन','ललित',
        'वफा','वफ़ीक़','वरुण','वाहिद','विक्की','विक्रांत','विजय','विजयंत','विराट','विवेक','विष्णु','वेंकट',
        'शरद','शशांक','शिरीष','श्रीनिवासन',
        'सतीश','सतीश्वर','समीर','साई','साहिल','सिड','सिद्धार्थ','सुभाष','सुमित','सुरेश','सुशांत','सूरज','सूर्या','सोमनाथ','सोहेल','सौरभ',
        'हनुमान','हबीब','हरप्रीत','हरभजन','हरी','हसन','हिमांशु','हिमेश','हेतन','हेमेंद्र',
    );

    protected static $firstNameFemale = array(
        'अखिला','अदिति','अनन्या','अनुषा','अमृता','अमोलिका','अरुणा','अलकनंदा','अलका','अल्पा','अवंतिका',
        'आकांक्षा','आफरीन','आभा','आयशा','आयुषी','आरती','आरुषि','आस्था','आस्था',
        'इंदिरा','इंद्राणी',
        'ईशा','ईशा',
        'उपासना','उमा','उर्मि','उर्मिला','उर्वशी',
        'ऊषा',
        'ऋचा',
        'ऐश्वर्या',
        'अंकिता','अंजना','अंबिका','अंशु','अंशुला',
        'कनिका','कनिष्ठा','कल्पना','कल्याणी','कस्तूरबा','कस्तूरी','काजल','काजोल','कामिनी','किम','किरण','कीर्ति','कुंती','कुसुम','कृष्णा','कोमल',
        'गायत्री','गीतांजलि','गुंजन','गुलाब','गोवरी',
        'चमेली','चांदनी','चारु','चित्रा',
        'छवि','छाया',
        'जयश्री','ज़रा','जाग्रति','जिया','जीनत','जूली','जूही','ज्योति',
        'टीना',
        'तनुजा','तुलसी','तृष्णा','तेजस्विनी',
        'दामिनी','दिया','दिव्या','दीप्ति','दृष्टि','देविका',
        'नगमा','नंदिनी','नमिता','नमिता','नर्मदा','नलिनी','नवमी','निकिता','निधि','नियति','निशि','निशिता','निष्ठा','नीतिका','नीलम','नीला','नीलिमा','नुपूर','नूतन','नूपुर','नेहा','नैना','नैन्सी',
        'पदमा','पद्मिनी','परमिंदर','पामेला','पायल','पुष्पा','पूजा','पूनम','प्रभा','प्रियंका','प्रेरणा','प्रेषिता',
        'फराह','फातिमा','फाल्गुनी',
        'बबिता','बसंती','बागवती','बिनीता','बिमला','बेला',
        'भाग्यश्री','भानुप्रिया','भैरवी',
        'मंजरी','मधु','माधवी','माया','मायावती','मिनी','मुक्ति','मुक्ति','मुन्नी','मृदुला','मेघना','मेघा','मोना','मोनिका',
        'यामिनी','यास्मीन',
        'राखी','रागिनी','राधा','राधिका','राहेल','रितिका','रिद्धि','रिमी','रिया','रीता','रुचि','रुनझुन','रोमा','रोसी','रोहिणी',
        'लक्ष्मी','लता','ललिता','लवीना','लीला','लीलावती',
        'विनीता','विमला','वीना','वैशाली',
        'शांति','शीतल','शोभा','श्वेता','श्वेता',
        'सपना','सबीना','समिधा','समीरा','सविता','सारा','सीमा','सुकृति','सुनीता','सुप्रिया','सुष्मिता','सोना','स्नेहा','स्मृति','स्वाति',
        'हिना','हिमानी','हीना','हीर','हीरा','हेमा',
    );

    protected static $lastName = array(
        'अइसेक','अग्रवाल','अटवाल','अमीन','अम्ब्ले','अयाल','अय्यर','अरोड़ा','अरोरा','अहलूवालिया',
        'आचार्य','आंद्रे','आनंद','आप्टे','आयंगर','आर्य','आहूजा',
        'इरानी',
        'उपाध्याय','उप्पल','उस्मान',
        'एगेट','एडविन','एंथोनी','ऐनी',
        'ओक','ओझा','ओम','ओमन',
        'कक्कड़','कडाकिआ','कड़े','कन्नन','कपाड़िया','कपूर','कमर','करण','कला','कलिता','कल्ला','कश्यप','काटा','काड़ा','कांडा','कांत','काबरा','कामदार','कार','कारी','कार्निक','कार्पे','काले','कीबे','कीर','कुंदा','कुमार','कुमेर','कुरियन','कुरुविला','कुलकर्णी','कृष','कृष्णन','कृष्णमूर्ति','कृष्णा','कोटा','कोठारी','कोंडा','कोरपाल','कोशी','कोहली','कौर','कौल',
        'खत्री','खन्ना','खरे','खान','खालसा','खुराना','खोसला',
        'गगरानी','गडे','गणेश','गणेशन','गर्ग','गांगुली','गांधी','गाबा','गारा','गार्डे','गाला','गिल','गुप्ता','गुलाटी','गुहा','गेरा','गोखले','गोदा','गोपाल','गोबिन','गोयल','गोल','गोला','गोल्ला','गोस्वामी','गौर','ग्रेवाल','ग्रोवर',
        'घोष',
        'चक्रवर्ती','चटर्जी','चड़ा','चड्ढा','चंद','चंदर','चंदा','चंद्रन','चंद्रा','चना','चहल','चाको','चाड','चार','चावला','चिया','चीमा','चेरियन','चोपड़ा','चौकशी','चौधरी','चौहान',
        'छाबड़ा',
        'जकर्याह','जकारिया','जग्गी','जयरामन','जानी','जैन','जॉर्ज','जोशी','जोहल',
        'झा','झावेरी',
        'टंडन','टाटा','टेलर','टैंक',
        'ठक्कर','ठाकरे','ठाकुर','ठेकेदार',
        'डायल','डार','डुगर','डे','डेट','डॉक्टर','डोडिया','डोरा',
        'ढिल्लों',
        'तक','तनेजा','तलवार','तल्ला','तारा','तिवारी','तूर','त्रिपाठी','त्रिवेदी',
        'थमान','थॉमस',
        'दत्त','दत्ता','दयाल','दलाल','दश','दानी','दारा','दास','दासगुप्ता','दीक्षित','दीन','दीप','दीवान','दुआ','दुगल','दुबे','दूबे','देओ','देओल','देव','देवन','देवी','देशपांडे','देशमुख','देसाई','दोषी',
        'धवन','धार','धालीवाल','धींगरा',
        'नगर','नटराजन','नट्ट','नडिग','नंदा','नरसिम्हन','नरुका','नरूला','नवल','नाइक','नागराजन','नागी','नाडकर्णी','नाथ','नायक','नायडू','नायर','नारंग','नारायण','नारायणन','नासरत','निगम','नोरी',
        'पऊ','पटला','पटेल','पंडित','पंड्या','पंत','पद्मनाभन','परदेशी','परमार','परमेर','परसा','परसाद','परसौद','पल','पल्ल','पल्ला','पांचाल','पाटिल','पाठक','पांडे','पारिख','पारेख','पालन','पिंगले','पिता','पिल्लै','पुरी','पुरोहित','पेरी','पै','प्रकाश','प्रधान','प्रभाकर','प्रभु','प्रसाद',
        'फिलिप',
        'बख्शी','बजाज','बट्टा','बत्रा','बंदी','बनर्जी','बम्ब','बराड़','बराल',
        'बर्मन','बलय','बसक','बंसल','बसु','बस्सी','बहरी','बहल','बाजवा','बाथ','बादल','बादामी','बानिक','बापू','बाबू','बारिया','बाल','बालन',
        'बालसुब्रमण्यन','बाला','बालाकृष्णन','बाली','बावा','बिन्नानी','बियानी','बिस्वास','बीर','बुच','बुटाला','बेदी','बेन','बेरा','बेल',
        'बेहरर्य','बेहल','बैंस','बोबल','बोरा','बोराह','बोर्डे','बोर्रा','बोस','बोसे','ब्रह्मभट्ट',
        'भक्त','भगत','भटनागर','भट्ट','भट्टाचार्य','भट्टी','भंडारी','भल्ला','भसीन','भाटिया','भारद्वाज','भार्गव','भावसर',
        'मंगत','मगर','मंगल','मंगोली','मजूमदार','मंड','मंडल','मणि','मथाई','मदन','मंदर','मंदा','मन्नान','मम्मेन','मरज','मर्चेंट','मल्लिक','मल्होत्रा','मसीह','महल','महाजन','महादेव','महाराज','महावीर','माथुर','मान','माने','माल','मालपानी','मास्टर','माहेश्वरी','मितल','मित्तर','मित्तल','मित्रा','मिन्हास','मिश्रा','मिसरा','मिस्त्री','मुखर्जी','मुखोपाध्याय','मुट्टी','मुनि','मुंशी','मूर्ति','मेका','मेदा','मेनन','मेमन','मेहता','मेहन','मेहरा','मेहरोत्रा','मैथ्यू','मोदी','मोर','मोरार','मोहंती','मोहन','मोहाबीर',
        'याकूब','यादव','योगी','योहन्नान',
        'रंगनाथन','रतन','रत्ता','रत्ती','रंधावा','रमन','रमेश','रवि','रस्तोगी','राघवन','राज','राजगोपाल','राजगोपालन','राजन','राजा','राजू','राधाकृष्णन','राना','राम','रामकिसून','रामकृष्णन','रामचंद्रन','रामनाथन','रामनारिने','रामपरसाद','रामपरसौद','रामरूप','रामसन','रामा','रामास्वामी','राय','राव','रावल','रावेल','रे','रेगे','रेड्डी','रॉय','रौत',
        'लंका','लछ्मण','लड़','लता','लल्ल','लल्ला','लाल','लाला','लूथरा','लोके','लोदी','लोयल',
        'वब्ले','वरुहेसे','वर्गीज','वर्ते','वर्मा','वली','वागले','वाधवा','वारियर','वार्की','वाला','वालिया','वाल्ला','वासन','वासा','विग','विर्क','विश्वनाथन','वेंकटरमण','वेंकटेश','वैद्य','वोरा','वोहरा','व्यास',
        'शंकर','शंकरन','शमूएल','शराफ','शर्मा','शा','शान','शास्त्री','शाह','शुक्ला','शेट्टी','शेनॉय','शेरे','शेषाद्रि','श्रीधर','श्रीनिवास','श्रीनिवासन','श्रीवास्तव',
        'सक्सेना','संघवी','संघा','सचदेव','सचदेवा','सच्चर','संत','संदल','संधू','संपत','सभरवाल','समा','सरकार','सरन','सरना','सरमा','सराफ','सरीन','सर्राफ','सहगल','सहोता','सागर','साठे','सानी','साने','सामरा','सामी','साल्वी','सावंत','साहनी','साहा','साहूकार','सिंग','सिंघल','सिद्धू','सिन्हा','सिब्बल','सिंह','सुंदरम','सुन्दर','सुब्रमण्यम','सुर','सुरा','सुराना','सुरेश','सुले','सूद','सूरी','सेखों','सेट्टी','सेठ','सेठी','सेन','सेनगुप्ता','सेम','सैनी','सोढानी','सोढ़ी','सोनी','सोम','सोमन','सोमानी','सोलंकी','स्वामी','स्वामीनाथन',
        'हरजो','हरि','हलदर','हंस','हांडा','हायरे','हेगड़े','हेयर','होरा',
    );

    protected static $middleNameMale = array(
        'देव', 'चंद्रा', 'कुमार', 'लाल', 'प्रसाद', 'राज', 'सिंह', 'राव', 'राम', 'प्रताप', 'भाई',
    );
    
    /**
     * Return male middle name
     *
     * @example 'Kumar'
     *
     * @access public
     *
     * @return string Middle name
     */
    public function middleNameMale()
    {
        return static::randomElement(static::$middleNameMale);
    }
}
